Identifier: com.github.ashleymckinlay.jamf.CitrixWorkspace
ParentRecipe: com.github.ashleymckinlay.pkg.CitrixWorkspace
MinimumVersion: '2.3'

Input:
  NAME: 'Citrix Workspace'
  SOFTWARE_TITLE: Citrix_Workspace
  ALL_COMPUTERS: 'true'
  CATEGORY: Applications
  GROUP_NAME: Applications
  GROUP_TEMPLATE: Live-Group-Template.xml
  INSTALL_BUTTON_TEXT: Install
  POLICY_CATEGORY: '%CATEGORY%'
  POLICY_NAME: '%NAME%'
  POLICY_RUN_COMMAND: ' '
  POLICY_TEMPLATE: Live-Policy-Template.xml
  REINSTALL_BUTTON_TEXT: Reinstall
  SELF_SERVICE_AVAILABLE: 'true'
  SELF_SERVICE_CATEGORY: Utilities
  SELF_SERVICE_DESCRIPTION: 'Citrix Workspace is the easy-to-install client software that provides access to your Citrix XenDesktop and XenApp installations.'
  SELF_SERVICE_DISPLAY_NAME: '%NAME%'
  SELF_SERVICE_ICON: '%SOFTWARE_TITLE%.png'
  SOFTWARE_TITLE_TRIGGER: '%SOFTWARE_TITLE%'
  UPDATE_PREDICATE: pkg_uploaded == False
