---
Description: Downloads the latest version of the OmniDiskSweeper App, then
  uploads to your Jamf Pro instance.
Identifier: com.github.ashleymckinlay.jamf.OmniDiskSweeper
ParentRecipe: com.ashleymckinlay.pkg.OmniDiskSweeper
MinimumVersion: "1.2"
Input:
  NAME: OmniDiskSweeper
  SOFTWARE_TITLE: "%NAME%"
  CATEGORY: Applications
  GROUP_NAME: "%NAME%-update-smart"
  GROUP_TEMPLATE: SmartGroup-update-smart.xml
  POLICY_CATEGORY: Applications
  POLICY_TEMPLATE: PolicyTemplate.xml
  POLICY_NAME: Install Latest %NAME%
  POLICY_RUN_COMMAND: " "
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_DESCRIPTION: Quickly find large, unwanted files and sweep them into
    the trash, OmniDiskSweeper shows you the files on your drive, largest to
    smallest, and lets you quickly Trash or open them.
  SELF_SERVICE_ICON: "%SOFTWARE_TITLE%.png"
  INSTALL_BUTTON_TEXT: Install
  REINSTALL_BUTTON_TEXT: Install
  UPDATE_PREDICATE: pkg_uploaded == False
Process:
  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%GROUP_TEMPLATE%"
      computergroup_name: "%GROUP_NAME%"
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELF_SERVICE_ICON%"
