Description: Downloads the latest version of dupeGuru and creates a package.
Identifier: com.github.amckinlay.pkg.x86_64.ideace
ParentRecipe: com.github.amckinlay.download.x86_64.ideace
MinimumVersion: "2.3"

Input:
  NAME: Intellij IDEA CE

Process:
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%pathname%"

  - Processor: AppPkgCreator
    Arguments:
      force_pkg_build: false
      pkg_path: "%RECIPE_CACHE_DIR%/IntelliJ-IDEA-CE-%version%.pkg"
