Description: Downloads the latest version of the Rectangle App, then uploads to your Jamf Pro instance.
Identifier: com.github.ashleymckinlay.jamf.SoapUI
ParentRecipe: com.github.dataJAR-recipes.pkg.SoapUI
MinimumVersion: '1.2'

Input:
  NAME: SoapUI
  SOFTWARE_TITLE: SoapUI
  CATEGORY: Applications
  GROUP_NAME: '%NAME%-update-smart'
  GROUP_TEMPLATE: SmartGroup-update-smart.xml
  POLICY_CATEGORY: Applications
  POLICY_TEMPLATE: PolicyTemplate.xml
  POLICY_NAME: 'Install Latest %NAME%'
  POLICY_RUN_COMMAND: ' '
  SELF_SERVICE_DISPLAY_NAME: 'Install Latest %NAME%'
  SELF_SERVICE_DESCRIPTION: 'Built for developers and testers alike, SoapUI is the only open source tool that covers the entire testing spectrum (functional, security, load, mocking). With its easy-to-use graphical interface, SoapUI is the entry point for API testing so you can validate REST, SOAP, and GraphQL-based web services with ease.'
  SELF_SERVICE_ICON: '%SOFTWARE_TITLE%.png'
  INSTALL_BUTTON_TEXT: 'Install'
  REINSTALL_BUTTON_TEXT: 'Install'
  UPDATE_PREDICATE: 'pkg_uploaded == False'

Process:
  - Processor: StopProcessingIf
    Arguments:
      predicate: '%UPDATE_PREDICATE%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: '%CATEGORY%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%UPDATE_PREDICATE%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: '%GROUP_TEMPLATE%'
      computergroup_name: '%GROUP_NAME%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: '%POLICY_TEMPLATE%'
      policy_name: '%POLICY_NAME%'
      icon: '%SELF_SERVICE_ICON%'
