---
Description: Downloads the latest version of the Ice App, then uploads to your
  Jamf Pro instance.
Identifier: com.github.ashleymckinlay.jamf.Signal
ParentRecipe: com.ashleymckinlay.pkg.Signal
MinimumVersion: "1.2"
Input:
  NAME: Signal
  SOFTWARE_TITLE: Signal
  CATEGORY: Applications
  GROUP_NAME: "%NAME%-update-smart"
  GROUP_TEMPLATE: SmartGroup-update-smart.xml
  POLICY_CATEGORY: Applications
  POLICY_TEMPLATE: PolicyTemplate.xml
  POLICY_NAME: Install Latest %NAME%
  POLICY_RUN_COMMAND: " "
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_DESCRIPTION: Send texts, voice messages, photos, videos, GIFs, and
    files for free. Signal uses your phone's data connection, so you avoid SMS
    and MMS fees.
  SELF_SERVICE_ICON: "%SOFTWARE_TITLE%.png"
  INSTALL_BUTTON_TEXT: Install
  REINSTALL_BUTTON_TEXT: Install
  UPDATE_PREDICATE: pkg_uploaded == False
Process:
  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%GROUP_TEMPLATE%"
      computergroup_name: "%GROUP_NAME%"
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELF_SERVICE_ICON%"
