Description: Downloads the latest version of Tableau, creates a package, then signs it.
Identifier: com.github.ashleymckinlay.sign.tableau
ParentRecipe: com.github.ashleymckinlay.pkg.tableau
MinimumVersion: '2.3'

Input:
  SIGNING_CERTIFICATE: Override_This_Value
  SOFTWARE_TITLE: Tableau

Process:
  - Processor: com.github.rtrouton.SharedProcessors/PkgSigner
    Arguments:
      pkg_path: '%pkg_path%'
      signing_cert: '%SIGNING_CERTIFICATE%'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: True
      path_list:
        - '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%-unsigned.pkg'
