<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Codefresh CLI.</string>
    <key>Identifier</key>
    <string>com.github.ashleymckinlay.pkg.CodefreshCLI</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Codefresh</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.ashleymckinlay.download.CodefreshCLI</string>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>usr</key>
                    <string>0755</string>
                    <key>usr/local</key>
                    <string>0755</string>
                    <key>usr/local/bin</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%pkgroot%/usr/local/bin/</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>id</key>
                    <string>com.github.ashleymckinlay.autopkg.CodefreshCLI</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>/usr/local/bin/codefresh</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                            <key>mode</key>
                            <string>0755</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%pkgroot%</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>