---
Description: Downloads the latest version, makes a pkg, uploads to the Jamf Pro
  Server, and creates a Self Service Policy.
Identifier: com.ashleymckinlay.jamf.Rive
Input:
  ALL_COMPUTERS: "true"
  CATEGORY: Applications
  GROUP_NAME: Apps
  GROUP_TEMPLATE: Live-Group-Template.xml
  INSTALL_BUTTON_TEXT: Install
  NAME: Rive
  POLICY_CATEGORY: "%CATEGORY%"
  POLICY_NAME: "%NAME%"
  POLICY_TEMPLATE: Live-Policy-Template.xml
  REINSTALL_BUTTON_TEXT: Reinstall
  SELF_SERVICE_AVAILABLE: "true"
  SELF_SERVICE_CATEGORY: Collaboration
  SELF_SERVICE_DESCRIPTION: Rive combines an interactive design tool, a new
    stateful graphics format, a lightweight multi-platform runtime, and a
    blazing-fast vector renderer. This end-to-end pipeline brings interfaces to
    life with motion. It gives designers and devs the tools to build
    award-winning interactive experiences across apps, games, websites,
    products, and vehicles.
  SELF_SERVICE_DISPLAY_NAME: "%NAME%"
  SELF_SERVICE_ICON: "%NAME%.png"
  SOFTWARE_TITLE: "%NAME%"
  SOFTWARE_TITLE_TRIGGER: "%SOFTWARE_TITLE%"
  UPDATE_PREDICATE: pkg_uploaded == False
MinimumVersion: "2.3"
ParentRecipe: com.ashleymckinlay.pkg.Rive

ParentRecipeTrustInfo:
  ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader:
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py
      sha256_hash: 04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e
    com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader:
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py
      sha256_hash: aa8ebac9c377a86525b80bd12b68b9d81352fedfe643b674c8a16b6273f0cd6d
    com.github.grahampugh.jamf-upload.processors/JamfPackageUploader:
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py
      sha256_hash: 5e07011e43e15871fd5e4b7003a234627e986f543083d4852575d4c16eb9d5c0
    com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader:
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py
      sha256_hash: 5d6715bfe85efbb3034ed36c27da2114742235232c0c156343fd70fc63d3d124
    com.github.rtrouton.SharedProcessors/PkgSigner:
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/SharedProcessors/PkgSigner.py
      sha256_hash: 464d1756f190a0161a6a00358cd42042bcdb5213802624d9ac58d3e723877a56
  parent_recipes:
    com.ashleymckinlay.download.Rive:
      path: ~/Library/AutoPkg/RecipeRepos/com.github.ashleymckinlay.amckinlay-recipes/Rive/Rive.download.recipe
      sha256_hash: e51f7390d5bf097f51ab8d3e620d5f1a8648e0eb3df48c254d38cef2071d242b
    com.ashleymckinlay.jamf.Rive:
      path: ~/Library/AutoPkg/RecipeRepos/com.github.ashleymckinlay.amckinlay-recipes/Rive/Rive.jamf.recipe.yaml
      sha256_hash: 581b29152de35adaf9a901ae9553a8df9ad7fa13680666f8ae801e052fef6296
    com.ashleymckinlay.pkg.Rive:
      path: ~/Library/AutoPkg/RecipeRepos/com.github.ashleymckinlay.amckinlay-recipes/Rive/Rive.pkg.recipe
      sha256_hash: a8ffcb8ccfc98abe7b33e41b321b895e4672a122a120677c9cb68ef4d6700fe9