---
Description: Downloads the latest version of the MongoDB App, then
  uploads to your Jamf Pro instance.
Identifier: com.github.ashleymckinlay.arm64.jamf.MongoDBCompass
ParentRecipe: com.github.ashleymckinlay.arm64.pkg.MongoDBCompass
MinimumVersion: "1.2"
Input:
  NAME: MongoDB
  SOFTWARE_TITLE: "%NAME%"
  CATEGORY: Applications
  GROUP_NAME: "%NAME%-update-smart"
  GROUP_TEMPLATE: SmartGroup-update-smart.xml
  POLICY_CATEGORY: Applications
  POLICY_TEMPLATE: PolicyTemplate.xml
  POLICY_NAME: Install Latest %NAME%
  POLICY_RUN_COMMAND: " "
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_DESCRIPTION: The Community version of our distributed database offers a flexible document data model along with support for ad-hoc queries, secondary indexing, and real-time aggregations to provide powerful ways to access and analyze your data.
  SELF_SERVICE_ICON: "%SOFTWARE_TITLE%.png"
  INSTALL_BUTTON_TEXT: Install
  REINSTALL_BUTTON_TEXT: Install
  UPDATE_PREDICATE: pkg_uploaded == False
Process:
  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%GROUP_TEMPLATE%"
      computergroup_name: "%GROUP_NAME%"
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELF_SERVICE_ICON%"
