<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.4.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of MongoDB Compass and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.ashleymckinlay.arm64.pkg.MongoDBCompass</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MongoDB Compass</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.ashleymckinlay.arm64.download.MongoDBCompass</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
			<key>Arguments</key>
			<dict>
                    <key>pkgname</key>
                    <string>%NAME%-%DOWNLOAD_TYPE%-%DOWNLOAD_VERSION%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
