Description: Downloads the latest version of Xray Exploratory App and creates a package.
Identifier: com.github.ashleymckinlay.pkg.Xray_Exploratory_App.arm64
ParentRecipe: com.github.ashleymckinlay.download.Xray_Exploratory_App.arm64
MinimumVersion: '2.3'

Input:
  NAME: Xray Exploratory App
  SOFTWARE_TITLE: Xray_Exploratory_App

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs: {}
      pkgroot: '%RECIPE_CACHE_DIR%/payload'

  - Processor: AppPkgCreator
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%version%.pkg'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: True
      path_list:
        - '%RECIPE_CACHE_DIR%/payload'
