Identifier: com.github.amckinlay.pkg.arm64.Android_Studio
ParentRecipe: com.github.amckinlay.download.arm64.Android_Studio
MinimumVersion: '2.3'

Input:
  SOFTWARE_TITLE: Android_Studio

Process:
  - Processor: AppPkgCreator
    Arguments:
      pkg_path: '%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%-%ARCHITECTURE%-%version%.pkg'
