Description: Downloads the latest versions (ARM and INTEL) of GitHub Desktop.
Identifier: com.github.amckinlay.download.jetbrainstoolbox
MinimumVersion: '2.3'

Input:
  NAME: 'Jetbrains Toolbox'
  SOFTWARE_TITLE: jetbrains-toolbox

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '((\w+):\/\/(\S*)(arm64)(\S*)(dmg)(?=\?))'
      result_output_var_name: match
      url: 'https://download-cdn.jetbrains.com/toolbox'

  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      filename: 'jetbrains-toolbox-arm64.dmg'
      download_dir: '%RECIPE_CACHE_DIR%/downloads'
      url: '%match%'

  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '((\w+):\/\/(\S*)(\S*)(dmg)(?=\?))'
      result_output_var_name: match
      url: 'https://download-cdn.jetbrains.com/toolbox'

  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      filename: 'jetbrains-toolbox.dmg'
      download_dir: '%RECIPE_CACHE_DIR%/downloads'
      url: '%match%'Process:

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%-arm64.dmg'
      destination_path: '%RECIPE_CACHE_DIR%/unpack/arm64'
      purge_destination: true

  - Processor: Unarchiver
    Arguments:
      archive_path: '%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%.dmg'
      destination_path: '%RECIPE_CACHE_DIR%/unpack/x86_64'
      purge_destination: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/unpack/arm64/JetBrains Toolbox.app'
      requirement: '(identifier "com.jetbrains.toolbox") and anchor apple generic and certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = 2ZEFAR8TH3'
      deep_verification: true
      strict_verification: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/unpack/x86_64/JetBrains Toolbox'
      requirement: '(identifier "com.jetbrains.toolbox") and anchor apple generic and certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = 2ZEFAR8TH3'
      deep_verification: true
      strict_verification: true

  - Processor: Versioner
    Arguments:
      input_plist_path: '%RECIPE_CACHE_DIR%/unpack/arm64/JetBrains Tooblox.app/Contents/Info.plist'
      plist_version_key: CFBundleShortVersionString