<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of JetBrains Toolbox and converts it into a pkg.</string>
	<key>Identifier</key>
	<string>com.github.amckinlay.pkg.JetBrainsToolbox</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>JetBrains Toolbox</string>
	</dict>
	<key>ParentRecipe</key>
	<string>ccom.github.amckinlay.download.JetBrainsToolbox</string>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
