<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest stable version of Wireshark.
    Acceptable values for the ARCH input variable include
    - Intel (default) Downloads Wireshark for Macs with Intel processors.
    - Arm Downloads Wireshark for Macs with Apple Silicon processors.
    </string>
    <key>Identifier</key>
    <string>com.github.amckinlay.arm64.download.wireshark</string>
    <key>Input</key>
    <dict>
        <key>ARCH</key>
        <string>Arm</string>
        <key>NAME</key>
        <string>Wireshark</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>Wireshark[%]20([\d\.]+)[%]20%ARCH%[%]2064.dmg</string>
                <key>result_output_var_name</key>
                <string>version</string>
                <key>url</key>
                <string>https://www.wireshark.org/download.html</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%ARCH%-%version%.dmg</string>
                <key>url</key>
                <string>https://www.wireshark.org/download/osx/Wireshark%20%version%%20%ARCH%%2064.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Wireshark*.app</string>
                <key>requirement</key>
                <string>anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7Z6EMTD2C6"</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
