<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Visual Studio Code and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.amckinlay.pkg.Visual_StudioCode</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Visual Studio Code</string>
		<key>NAME</key>
		<string>Code</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.amckinlay.download.Visual_Studio_Code</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
