Description: Downloads the latest version, makes a pkg, uploads to the Jamf Pro Server, and creates a Self Service Policy.
Identifier: com.github.amckinlay.jamf.microsoftcopliot
ParentRecipe: com.github.rtrouton.pkg.microsoftcopliot
MinimumVersion: '2.3'
Input:
  NAME: Copilot
  ALL_COMPUTERS: 'true'
  CATEGORY: Applications
  GROUP_NAME: Apps
  GROUP_TEMPLATE: Live-Group-Template.xml
  INSTALL_BUTTON_TEXT: Install
  POLICY_CATEGORY: '%CATEGORY%'
  POLICY_NAME: '%NAME%'
  POLICY_RUN_COMMAND: ' '
  POLICY_TEMPLATE: Live-Policy-Template.xml
  REINSTALL_BUTTON_TEXT: Reinstall
  SELF_SERVICE_AVAILABLE: 'true'
  SELF_SERVICE_CATEGORY: '%CATEGORY%'
  SELF_SERVICE_DESCRIPTION: 'Your AI companion on macOS — chat in GPT-5 Smart Mode, enjoy smooth native experience, have voice chats, spark ideas with Think Deeper, and create AI images.'
  SELF_SERVICE_DISPLAY_NAME: '%NAME%'
  SELF_SERVICE_ICON: '%NAME%.png'
  SIGNING_CERTIFICATE: 'Developer ID Installer: ANZ Banking Group Limited (JC79QBZPRF)'
  SOFTWARE_TITLE: '%NAME%'
  SOFTWARE_TITLE_TRIGGER: '%SOFTWARE_TITLE%'
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
  - Processor: StopProcessingIf
    Arguments:
      predicate: '%UPDATE_PREDICATE%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: '%CATEGORY%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%UPDATE_PREDICATE%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: '%GROUP_TEMPLATE%'
      computergroup_name: '%GROUP_NAME%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: '%POLICY_TEMPLATE%'
      policy_name: '%POLICY_NAME%'
      icon: '%SELF_SERVICE_ICON%'
